Edited/GetReadingsByUOMAndDate_Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <MultiSpeakMsgHeader UserID="" Pwd="" xmlns="http://www.multispeak.org/Version_4.1_Release" />
  </soap:Header>
  <soap:Body>
    <GetReadingsByUOMAndDate xmlns="http://www.multispeak.org/Version_4.1_Release">
      <uomData>kWh</uomData>
      <startDate>2015-03-01T09:00:00Z</startDate>
      <endDate>2015-03-31T09:00:00Z</endDate>
      <lastReceived>string</lastReceived>
    </GetReadingsByUOMAndDate>
  </soap:Body>
</soap:Envelope>